[
    {
        "Year": 2023,
        "Month": 0,
        "Bestsellers": [
            {
                "Year": 2023,
                "Month": 0,
                "Book_id": 3,
                "Book_Title": "To Kill a Mockingbird",
                "Author": "Harper Lee",
                "Publisher": "Grand Central Publishing",
                "Quantity_Sold": 2,
                "Genre": "Novel",
                "Description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.\n\nCompassionate, dramatic, and deeply moving, To Kill A Mockingbird takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
                "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/3.jpg",
                "Selling_Price": "101.06"
            },
            {
                "Year": 2023,
                "Month": 0,
                "Book_id": 4,
                "Book_Title": "1984",
                "Author": "George Orwell",
                "Publisher": "Signet Classic",
                "Quantity_Sold": 2,
                "Genre": "Novel",
                "Description": "“The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.”\n\nWinston Smith toes the Party line, rewriting history to satisfy the demands of the Ministry of Truth. With each lie he writes, Winston grows to hate the Party that seeks power for its own sake and persecutes those who dare to commit thoughtcrimes. But as he starts to think for himself, Winston can’t escape the fact that Big Brother is always watching...\n\nA startling and haunting novel, 1984 creates an imaginary world that is completely convincing from start to finish. No one can deny the novel’s hold on the imaginations of whole generations, or the power of its admonitions—a power that seems to grow, not lessen, with the passage of time.",
                "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/4.jpg",
                "Selling_Price": "77.72"
            },
            {
              "Year": 2023,
              "Month": 0,
              "Book_id": 8,
              "Book_Title": "Lord of the Flies",
              "Author": "William Golding",
              "Publisher": "Penguin",
              "Quantity_Sold": 2,
              "Genre": "Literature",
              "Description": "At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate. This far from civilization they can do anything they want. Anything. But as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far removed from reality as the hope of being rescued.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/8.jpg",
              "Selling_Price": "62.16"
            },
            {
              "Year": 2023,
              "Month": 0,
              "Book_id": 11,
              "Book_Title": "Catch-22",
              "Author": "Joseph Heller",
              "Publisher": "Simon & Schuster",
              "Quantity_Sold": 2,
              "Genre": "Novel",
              "Description": "At the heart of Catch-22 resides the incomparable, malingering bombardier, Yossarian, a hero endlessly inventive in his schemes to save his skin from the horrible chances of war. His efforts are perfectly understandable because as he furiously scrambles, thousands of people he hasn't even met are trying to kill him. His problem is Colonel Cathcart, who keeps raising the number of missions the men must fly to complete their service. Yet if Yossarian makes any attempts to excuse himself from the perilous missions that he is committed to flying, he is trapped by the Great Loyalty Oath Crusade, the hilariously sinister bureaucratic rule from which the book takes its title: a man is considered insane if he willingly continues to fly dangerous combat missions, but if he makes the necessary formal request to be relieved of such missions, the very act of making the request proves that he is sane and therefore ineligible to be relieved.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/11.jpg",
              "Selling_Price": "77.72"
            },
            {
              "Year": 2023,
              "Month": 0,
              "Book_id": 15,
              "Book_Title": "The Hitchhiker's Guide to the Galaxy",
              "Author": "Douglas Adams",
              "Publisher": "Del Rey",
              "Quantity_Sold": 2,
              "Genre": "Literature",
              "Description": "It’s an ordinary Thursday morning for Arthur Dent . . . until his house gets demolished. The Earth follows shortly after to make way for a new hyperspace express route, and Arthur’s best friend has just announced that he’s an alien.\n\nAfter that, things get much, much worse.\n\nWith just a towel, a small yellow fish, and a book, Arthur has to navigate through a very hostile universe in the company of a gang of unreliable aliens. Luckily the fish is quite good at languages. And the book is The Hitchhiker’s Guide to the Galaxy . . . which helpfully has the words DON’T PANIC inscribed in large, friendly letters on its cover.\n\nDouglas Adams’s mega-selling pop-culture classic sends logic into orbit, plays havoc with both time and physics, offers up pithy commentary on such things as ballpoint pens, potted plants, and digital watches . . . and, most important, reveals the ultimate answer to life, the universe, and everything.\n\nNow, if you could only figure out the question. . . .",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/15.jpg",
              "Selling_Price": "116.62"
            },
            {
              "Year": 2023,
              "Month": 0,
              "Book_id": 19,
              "Book_Title": "The Bell Jar",
              "Author": "Sylvia Plath",
              "Publisher": "Harper Perennial",
              "Quantity_Sold": 2,
              "Genre": "Literature",
              "Description": "The Bell Jar is the only novel written by the American writer and poet Sylvia Plath. Originally published under the pseudonym \"Victoria Lucas\" in 1963, the novel is semi-autobiographical with the names of places and people changed. The book is often regarded as a roman à clef because the protagonist's descent into mental illness parallels Plath's own experiences with what may have been clinical depression or bipolar II disorder.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/19.jpg",
              "Selling_Price": "77.7222"
            },
            {
              "Year": 2023,
              "Month": 0,
              "Book_id": 30,
              "Book_Title": "The Divine Comedy",
              "Author": "Dante Alighieri",
              "Publisher": "Penguin Classics",
              "Quantity_Sold": 2,
              "Genre": "Social science and history",
              "Description": "The Divine Comedy is an Italian narrative poem by Dante Alighieri, begun c. 1308 and completed around 1321, shortly before the author's death. It is widely considered the pre-eminent work in Italian literature and one of the greatest works of world literature.[2] The poem's imaginative vision of the afterlife is representative of the medieval worldview as it existed in the Western Church by the 14th century.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/30.jpg",
              "Selling_Price": "116.622"
            },
            {
              "Year": 2023,
              "Month": 0,
              "Book_id": 37,
              "Book_Title": "dA夯12：地理啟蒙",
              "Author": "劉克峰",
              "Publisher": "田園城市",
              "Quantity_Sold": 2,
              "Genre": "城市地理",
              "Description": "《dA夯12》延續前一期的現代性議題，著眼於「啟蒙之後」的亞洲建築樣態論述，探討包含台南、象集團等案例如何從「地方」挖掘出在地的視野與構成，同時也收錄2012威尼斯建築雙年展台灣館以「地理啟蒙」為主題的完整展出內容。而在新單元「夯建築」系列，則推介以今年威尼斯建築雙年展參展建築師廖偉立、林友寒兩人的作品，廖偉立的水彩手稿與在地文化的挖掘、林友寒的歐洲執業經驗，以及兩人分別與台灣知名建築評論名家阮慶岳的對談中，都從建築師自身出發，呼應了本期軸心主題。",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/37.jpg",
              "Selling_Price": "100"
            },
            {
              "Year": 2023,
              "Month": 0,
              "Book_id": 6,
              "Book_Title": "Animal Farm",
              "Author": "George Orwell",
              "Publisher": "Signet Classic",
              "Quantity_Sold": 1,
              "Genre": "Biography",
              "Description": "“All animals are equal, but some animals are more equal than others.”\n\nA farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. Thus the stage is set for one of the most telling satiric fables ever penned—a razor-edged fairy tale for grown-ups that records the evolution from revolution against tyranny to a totalitarianism just as terrible. \n \nWhen Animal Farm was first published, Stalinist Russia was seen as its target. Today it is devastatingly clear that wherever and whenever freedom is attacked, under whatever banner, the cutting clarity and savage comedy of George Orwell’s masterpiece have a meaning and message still ferociously fresh.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/6.jpg",
              "Selling_Price": "69.9422"
            }
        ]
    },
    {
        "Year": 2023,
        "Month": 1,
        "Bestsellers": [
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 1,
              "Book_Title": "演算法圖鑒：26種演算法+7種資料結構，人工智慧、數據分析、邏輯思考的原理和應用全圖解",
              "Author": "石田保輝、宮崎修一著，陳彩華譯",
              "Publisher": "城邦文化",
              "Quantity_Sold": 5,
              "Genre": "邏輯 思維",
              "Description": "讀再多文字解說都看不懂？沒關係，全部畫給你看，一次弄懂演算法到底是什麼！直觀理解，從基礎開始學習，一用就上手的演算法專書！全圖像化step by step，完整拆解制霸AI時代的演算法精髓！\n詳解演算法的奧妙、運作效率、優缺點，活化思維，做出最佳決斷！演算法時代來了！現今我們的世界已離不開演算法，從線上搜尋、社群交友、法院判案、醫學診斷、金融運作、大腦決策到人工智慧的未來，越了解演算法，越可能掌控權力，成為時代的贏家。有些演算法對我們有益、有些有用，有些則可能使我們陷入大麻煩，但我們對這些演算法所知極少。不管用哪種程式語言編寫程式，演算法都是不可或缺的，不過如果認為只有學電腦的人才要了解演算法，那就太可惜了。演算法其實是一連串解決問題的邏輯步驟，只要熟悉這些步驟和運用方式，每個人都能設計自己的演算法並應用於各種不同領域。學習演算法正是建構嚴謹思維和幫助做出最佳判斷的訓練。演算法的第一本書，從基礎開始學習！演算法是用以執行計算或完成作業的程序，可以想像成料理食譜，如果做出某種料理的步驟是食譜，那麼用電腦解出特定問題的步驟就是演算法了。然而，食譜與演算法的決定性差異，在於演算法非常嚴謹。相較於食譜有很多概略的描述，演算法的所有步驟都用數學方式表現，沒有模糊地帶。本書蒐羅介紹26種基本的演算法和7種資料結構，貨真價實完全圖解。每一個步驟都以圖片和文字詳細說明，拆解具體演算過程，逐步建立邏輯概念，輕鬆進入演算法的世界。書中解說的演算法範疇包括「排序」、「陣列搜尋」、「圖形搜尋」、「安全性演算法」、「聚類」，以及「網頁排名」等各種廣泛使用的基礎演算法。不用艱澀的專有名詞，步步口語分解，完全沒有概念的人也能漸進學習。",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/1.jpg",
              "Selling_Price": "110"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 10,
              "Book_Title": "One Hundred Years of Solitude",
              "Author": "Gabriel García Márquez",
              "Publisher": "Harper Perennial",
              "Quantity_Sold": 4,
              "Genre": "Novel",
              "Description": "One Hundred Years of Solitude tells the story of the rise and fall, birth and death of the mythical town of Macondo through the history of the Buendiá family. Inventive, amusing, magnetic, sad and alive with unforgettable men and women—brimming with truth, compassion, and a lyrical magic that strikes the soul—this novel is a masterpiece in the art of fiction.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/10.jpg",
              "Selling_Price": "108.84"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 11,
              "Book_Title": "Catch-22",
              "Author": "Joseph Heller",
              "Publisher": "Simon & Schuster",
              "Quantity_Sold": 4,
              "Genre": "Novel",
              "Description": "At the heart of Catch-22 resides the incomparable, malingering bombardier, Yossarian, a hero endlessly inventive in his schemes to save his skin from the horrible chances of war. His efforts are perfectly understandable because as he furiously scrambles, thousands of people he hasn't even met are trying to kill him. His problem is Colonel Cathcart, who keeps raising the number of missions the men must fly to complete their service. Yet if Yossarian makes any attempts to excuse himself from the perilous missions that he is committed to flying, he is trapped by the Great Loyalty Oath Crusade, the hilariously sinister bureaucratic rule from which the book takes its title: a man is considered insane if he willingly continues to fly dangerous combat missions, but if he makes the necessary formal request to be relieved of such missions, the very act of making the request proves that he is sane and therefore ineligible to be relieved.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/11.jpg",
              "Selling_Price": "77.72"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 20,
              "Book_Title": "The Color Purple",
              "Author": "Alice Walker",
              "Publisher": "Mariner Books",
              "Quantity_Sold": 4,
              "Genre": "Literature",
              "Description": "The Color Purple is a 1982 epistolary novel by American author Alice Walker which won the 1983 Pulitzer Prize for Fiction and the National Book Award for Fiction. It was later adapted into a film and musical of the same name.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/20.jpg",
              "Selling_Price": "116.62"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 2,
              "Book_Title": "后翼棄兵",
              "Author": "沃爾特·特維斯著，呂玉嬋、陳芙楊譯",
              "Publisher": "皇冠文化出版有限公司",
              "Quantity_Sold": 2,
              "Genre": "Novel",
              "Description": "NETFLIX史上最強神劇經典原著小說！\n橫掃63國收視冠軍！榮獲金球獎最佳迷你影集、最佳女主角！「后翼棄兵」是一種西洋棋的開局法，執白子者為了取得優勢，會先犧牲一個兵。貝絲的故事，也是從當「棄子」開始。在她小時候，媽媽常嚷著「去死」，直到八歲那年，媽媽真的死了，於是她住進了梅休因之家。偶爾有一些穿著體面的夫婦會來到這裡，牽著幸運的女孩離開，但更多人像貝絲一樣，知道自己永遠也離不開。幸好大多數的時候日子還過得去，她每天可以領兩次安定心神的小藥丸，禮拜二算術課結束後，她會到地下室清理板擦，順便看工友薛波先生玩那個叫做「西洋棋」的神秘遊戲。一開始她只是靜靜地在旁觀看，然後在失眠的夜裡，將寢室的天花板化作棋盤，在腦海中演繹自己的棋局。貝絲的心隨著棋盤上的黑白棋子起舞，它們接納她的靈魂，她的靈魂也接納了它們。「女孩子不下棋。」薛波先生起初對貝絲不以為然，直到她第一次戰勝了他，然後是高中圍棋社老師、地區西洋棋大師……回過神來，她已展開美國國際西洋棋公開賽冠軍的角逐。然而伴隨著獎金和名氣而來的，卻是如影隨形的孤獨和藥物成癮的夢魘。她能戰勝心魔，下好「人生」這一盤棋嗎？",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/2.jpg",
              "Selling_Price": "70"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 19,
              "Book_Title": "The Bell Jar",
              "Author": "Sylvia Plath",
              "Publisher": "Harper Perennial",
              "Quantity_Sold": 2,
              "Genre": "Literature",
              "Description": "The Bell Jar is the only novel written by the American writer and poet Sylvia Plath. Originally published under the pseudonym \"Victoria Lucas\" in 1963, the novel is semi-autobiographical with the names of places and people changed. The book is often regarded as a roman à clef because the protagonist's descent into mental illness parallels Plath's own experiences with what may have been clinical depression or bipolar II disorder.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/19.jpg",
              "Selling_Price": "77.72"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 23,
              "Book_Title": "The Sun Also Rises",
              "Author": "Ernest Hemingway",
              "Publisher": "Scribner",
              "Quantity_Sold": 2,
              "Genre": "Literature",
              "Description": "The Sun Also Rises is a 1926 novel by American writer Ernest Hemingway, his first, that portrays American and British expatriates who travel from Paris to the Festival of San Fermín in Pamplona to watch the running of the bulls and the bullfights. An early modernist novel, it received mixed reviews upon publication. Hemingway biographer Jeffrey Meyers writes that it is now \"recognized as Hemingway's greatest work\" and Hemingway scholar Linda Wagner-Martin calls it his most important novel. The novel was published in the United States in October 1926 by Scribner's. A year later, Jonathan Cape published the novel in London under the title Fiesta.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/23.jpg",
              "Selling_Price": "62.16"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 30,
              "Book_Title": "The Divine Comedy",
              "Author": "Dante Alighieri",
              "Publisher": "Penguin Classics",
              "Quantity_Sold": 2,
              "Genre": "Social science and history",
              "Description": "The Divine Comedy is an Italian narrative poem by Dante Alighieri, begun c. 1308 and completed around 1321, shortly before the author's death. It is widely considered the pre-eminent work in Italian literature and one of the greatest works of world literature.[2] The poem's imaginative vision of the afterlife is representative of the medieval worldview as it existed in the Western Church by the 14th century.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/30.jpg",
              "Selling_Price": "116.62"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 32,
              "Book_Title": "Frankenstein",
              "Author": "Mary Shelley",
              "Publisher": "Dover Publications",
              "Quantity_Sold": 2,
              "Genre": "Literature",
              "Description": "Frankenstein is an 1818 novel written by English author Mary Shelley. Frankenstein tells the story of Victor Frankenstein, a young scientist who creates a sapient creature in an unorthodox scientific experiment. Shelley started writing the story when she was 18, and the first edition was published anonymously in London on 1 January 1818, when she was 20. Her name first appeared in the second edition, which was published in Paris in 1821.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/32.jpg",
              "Selling_Price": "85.50"
            },
            {
              "Year": 2023,
              "Month": 1,
              "Book_id": 44,
              "Book_Title": "精神分析引論（新版）",
              "Author": "Sigmund Freud",
              "Publisher": "左岸文化",
              "Quantity_Sold": 2,
              "Genre": "精神分析",
              "Description": "本書為佛洛伊德於1915-1917年間，在維也納大學冬季學期開設的精神分析課程之演講內容集結。書中不僅可以看到佛洛伊德本人對其先前理論所做的整理，也可發現許多後續發展的線索，如「強迫性重複」、自我的分析，以及「無意識」一詞的多重意義所導致的困難等，皆已有所討論。\n",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/44.jpg",
              "Selling_Price": "93.28"
            }
        ]
    },
    {
        "Year": 2023,
        "Month": 2,
        "Bestsellers": [
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 1,
              "Book_Title": "演算法圖鑒：26種演算法+7種資料結構，人工智慧、數據分析、邏輯思考的原理和應用全圖解",
              "Author": "石田保輝、宮崎修一著，陳彩華譯",
              "Publisher": "城邦文化",
              "Quantity_Sold": 9,
              "Genre": "邏輯 思維",
              "Description": "讀再多文字解說都看不懂？沒關係，全部畫給你看，一次弄懂演算法到底是什麼！直觀理解，從基礎開始學習，一用就上手的演算法專書！全圖像化step by step，完整拆解制霸AI時代的演算法精髓！\n詳解演算法的奧妙、運作效率、優缺點，活化思維，做出最佳決斷！演算法時代來了！現今我們的世界已離不開演算法，從線上搜尋、社群交友、法院判案、醫學診斷、金融運作、大腦決策到人工智慧的未來，越了解演算法，越可能掌控權力，成為時代的贏家。有些演算法對我們有益、有些有用，有些則可能使我們陷入大麻煩，但我們對這些演算法所知極少。不管用哪種程式語言編寫程式，演算法都是不可或缺的，不過如果認為只有學電腦的人才要了解演算法，那就太可惜了。演算法其實是一連串解決問題的邏輯步驟，只要熟悉這些步驟和運用方式，每個人都能設計自己的演算法並應用於各種不同領域。學習演算法正是建構嚴謹思維和幫助做出最佳判斷的訓練。演算法的第一本書，從基礎開始學習！演算法是用以執行計算或完成作業的程序，可以想像成料理食譜，如果做出某種料理的步驟是食譜，那麼用電腦解出特定問題的步驟就是演算法了。然而，食譜與演算法的決定性差異，在於演算法非常嚴謹。相較於食譜有很多概略的描述，演算法的所有步驟都用數學方式表現，沒有模糊地帶。本書蒐羅介紹26種基本的演算法和7種資料結構，貨真價實完全圖解。每一個步驟都以圖片和文字詳細說明，拆解具體演算過程，逐步建立邏輯概念，輕鬆進入演算法的世界。書中解說的演算法範疇包括「排序」、「陣列搜尋」、「圖形搜尋」、「安全性演算法」、「聚類」，以及「網頁排名」等各種廣泛使用的基礎演算法。不用艱澀的專有名詞，步步口語分解，完全沒有概念的人也能漸進學習。",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/1.jpg",
              "Selling_Price": "110"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 34,
              "Book_Title": "Meditations",
              "Author": "Marcus Aurelius",
              "Publisher": "Dover Publications",
              "Quantity_Sold": 6,
              "Genre": "Philosophy",
              "Description": "Meditations is a series of personal writings by Marcus Aurelius, Roman Emperor from AD 161 to 180, recording his private notes to himself and ideas on Stoic philosophy.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/34.jpg",
              "Selling_Price": "77.72"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 7,
              "Book_Title": "Brave New World",
              "Author": "Aldous Huxley",
              "Publisher": "Harper Perennial",
              "Quantity_Sold": 3,
              "Genre": "Social science and history",
              "Description": "Aldous Huxley's profoundly important classic of world literature, Brave New World is a searching vision of an unequal, technologically-advanced future where humans are genetically bred, socially indoctrinated, and pharmaceutically anesthetized to passively uphold an authoritarian ruling order–all at the cost of our freedom, full humanity, and perhaps also our souls. “A genius [who] who spent his life decrying the onward march of the Machine” (The New Yorker), Huxley was a man of incomparable talents: equally an artist, a spiritual seeker, and one of history’s keenest observers of human nature and civilization. Brave New World, his masterpiece, has enthralled and terrified millions of readers, and retains its urgent relevance to this day as both a warning to be heeded as we head into tomorrow and as thought-provoking, satisfying work of literature. Written in the shadow of the rise of fascism during the 1930s, Brave New World likewise speaks to a 21st-century world dominated by mass-entertainment, technology, medicine and pharmaceuticals, the arts of persuasion, and the hidden influence of elites. ",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/7.jpg",
              "Selling_Price": "93.28"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 8,
              "Book_Title": "Lord of the Flies",
              "Author": "William Golding",
              "Publisher": "Penguin",
              "Quantity_Sold": 3,
              "Genre": "Literature",
              "Description": "At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate. This far from civilization they can do anything they want. Anything. But as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far removed from reality as the hope of being rescued.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/8.jpg",
              "Selling_Price": "62.16"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 13,
              "Book_Title": "The Diary of a Young Girl",
              "Author": "Anne Frank",
              "Publisher": "Bantam",
              "Quantity_Sold": 3,
              "Genre": "Literature",
              "Description": "Discovered in the attic where she spnt the last years of her life, Anne Frank’s remarkable diary has become a world classic—a powerful reminder of the horrors of war and an eloquent testament to the human spirit.\n\nIn 1942, as Nazis occupied Holland, a thirteen-year-old Jewish girl and her family fled their home in Amsterdam and went into hiding. For the next two years, until their whereabouts were betrayed to the Gestapo, they and another family lived cloistered in the secret upstairs rooms of an old office building. Cut off from the outside world, they faced hunger, boredom, the constant cruelties of living in confined quarters, and the ever-present threat of discovery and death.\n\nIn her diary Anne Frank recorded vivid impressions of her experiences during this period. By turns thoughtful, moving, and amusing, Anne’s account offers a fascinating commentary on human courage and frailty and a compelling self-portrait of a sensitive and spirited young woman whose promise was tragically cut short.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/13.jpg",
              "Selling_Price": "69.94"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 18,
              "Book_Title": "The Picture of Dorian Gray",
              "Author": "Oscar Wilde",
              "Publisher": "Dover Publications",
              "Quantity_Sold": 3,
              "Genre": "Literature",
              "Description": "The Picture of Dorian Gray is a philosophical novel by Irish writer Oscar Wilde. A shorter novella-length version was published in the July 1890 issue of the American periodical Lippincott's Monthly Magazine. The novel-length version was published in April 1891.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/18.jpg",
              "Selling_Price": "101.06"
            },
            {
                "Year": 2023,
                "Month": 2,
                "Book_id": 19,
                "Book_Title": "The Bell Jar",
                "Author": "Sylvia Plath",
                "Publisher": "Harper Perennial",
                "Quantity_Sold": 3,
                "Genre": "Literature",
                "Description": "The Bell Jar is the only novel written by the American writer and poet Sylvia Plath. Originally published under the pseudonym \"Victoria Lucas\" in 1963, the novel is semi-autobiographical with the names of places and people changed. The book is often regarded as a roman à clef because the protagonist's descent into mental illness parallels Plath's own experiences with what may have been clinical depression or bipolar II disorder.",
                "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/19.jpg",
                "Selling_Price": "77.72"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 33,
              "Book_Title": "Fading Neon Lights: An Archive of Hong Kong’s Visual Culture",
              "Author": "Kwok Sze Hang, Brian",
              "Publisher": "City University of Hong Kong Press",
              "Quantity_Sold": 3,
              "Genre": "Hong Kong Studies",
              "Description": "This book documents Hong Kong’s neon signs whilst taking on a historical, socio-cultural, and contextual study of visual culture around the city. It explores the inter-related components of neon signs, including each sign’s unique visual aesthetic and design, the history of craftsmanship and training, and how the streetscape relates to Hong Kong’s consumer culture.",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/33.jpg",
              "Selling_Price": "101.06"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 43,
              "Book_Title": "如何認識世界與自我: 大學哲學通識入門",
              "Author": "譚家博",
              "Publisher": "時報文化出版企業股份有限公司",
              "Quantity_Sold": 3,
              "Genre": "哲學",
              "Description": "哲學一點也不難！讓你輕鬆讀懂哲學的第一本書\n\n哲學教人如何思考、如何發現謬誤，更教人尋找生命意義與人生價值：\n我是誰？我為何而活？我又該如何活出自我？",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/43.jpg",
              "Selling_Price": "69.94"
            },
            {
              "Year": 2023,
              "Month": 2,
              "Book_id": 44,
              "Book_Title": "精神分析引論（新版）",
              "Author": "Sigmund Freud",
              "Publisher": "左岸文化",
              "Quantity_Sold": 3,
              "Genre": "精神分析",
              "Description": "本書為佛洛伊德於1915-1917年間，在維也納大學冬季學期開設的精神分析課程之演講內容集結。書中不僅可以看到佛洛伊德本人對其先前理論所做的整理，也可發現許多後續發展的線索，如「強迫性重複」、自我的分析，以及「無意識」一詞的多重意義所導致的困難等，皆已有所討論。\n",
              "Book_Cover": "https://hkreader-book-cover.s3.ap-southeast-1.amazonaws.com/44.jpg",
              "Selling_Price": "93.28"
            }
        ]
    }
]